#### CutWithHalfSpace Method

---

|  |
| --- |
| BooleanOperationsUtils Class   See Also |

Creates a new Solid which is the intersection of the input Solid with the half-space on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static Solid CutWithHalfSpace( 	Solid solid, 	Plane plane ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CutWithHalfSpace ( _ 	solid As Solid, _ 	plane As Plane _ ) As Solid ``` |

| Visual C++ |
| --- |
| ``` public: static Solid^ CutWithHalfSpace( 	Solid^ solid,  	Plane^ plane ) ``` |

#### Parameters

solid
:   Type:  Autodesk.Revit.DB Solid
     The input Solid to be cut.

plane
:   Type:  Autodesk.Revit.DB Plane
     The cut plane. The space on the positive side of the normal of the plane will be intersected with the input Solid.

#### Return Value

The newly created Solid.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

BooleanOperationsUtils Class

Autodesk.Revit.DB Namespace